Catalogs/упЗапчасти.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упЗапчасти</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МодельТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упМоделиТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/упЦеныЗапчастей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упЦеныЗапчастей</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Запчасть</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упЗапчасти</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/упЗапчасти/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возрвает цену указанной запчасти.
//
// Параметры:
//  Ссылка  - СправочникСсылка - Ссылка на элемент.
//  ДатаСреза  - Дата - Период.
//
// Возвращаемое значение:
//   Число - Актуальная Цена.
//
Функция ПолучитьЦенуЗапчасти(Ссылка, ДатаСреза = Неопределено) Экспорт
	
	АктуальнаяЦена = 0;
	
	Запрос = новый Запрос;
	Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	упЦеныЗапчастейСрезПоследних.Цена
	 |ИЗ
	 |	РегистрСведений.упЦеныЗапчастей.СрезПоследних(&Период, Запчасть = &Запчасть) КАК упЦеныЗапчастейСрезПоследних";
	 Запрос.УстановитьПараметр("Период", ?(ДатаСреза = Неопределено, ТекущаяДатаСеанса(), ДатаСреза));
	 Запрос.УстановитьПараметр("Запчасть", Ссылка);
	 Результат = Запрос.Выполнить();
	 
	 Если Не Результат.Пустой() Тогда
		 Выборка = Результат.Выбрать();
		 Выборка.Следующий();
		 АктуальнаяЦена = Выборка.Цена;
	 КонецЕсли; 
	
     Возврат АктуальнаяЦена;

КонецФункции // ПолучитьЦенуЗапчасти()
 
#КонецОбласти

#Область ОбработчикиСобытий

// Нет.

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Нет.

#КонецОбласти

#КонецЕсли
